/*----------------------------------------------------------------------------------------
*
* 文字参照テーブル関係
*
*----------------------------------------------------------------------------------------*/
#pragma once


//----------------------------------------------
// 参照テーブル要素の型
//
struct RefChar
{
	const wchar_t*	refString;		//!< 参照文字列
	wchar_t			refChar;		//!< 解決される文字
};


//----------------------------------------------
// 参照テーブル
//	終端の要素はREFCHAR_NULL, L'\0'です。
//
#define REFCHAR_NULL	((wchar_t*)0)
extern RefChar sg_RefCharList[];
